# WebScraping Assignment2 using Selenium

In [1]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\abc\anaconda3\lib\site-packages (4.4.3)
Requirement already satisfied: trio~=0.17 in c:\users\abc\anaconda3\lib\site-packages (from selenium) (0.22.0)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\abc\anaconda3\lib\site-packages (from selenium) (2022.9.24)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\abc\anaconda3\lib\site-packages (from selenium) (0.9.2)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\users\abc\anaconda3\lib\site-packages (from selenium) (1.26.12)
Requirement already satisfied: async-generator>=1.9 in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: sniffio in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0)
Requirement already satisfied: cffi>=1.14; os_name == "nt" and implementation_name != "pypy" in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.14.0)
Requirement already satisfied: outcome in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: attrs>=19.2.0 in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (19.3.0)
Requirement already satisfied: idna in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.8)
Requirement already satisfied: exceptiongroup>=1.0.0rc9; python_version < "3.11" in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.0.0rc9)
Requirement already satisfied: sortedcontainers in c:\users\abc\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.1.0)
Requirement already satisfied: wsproto>=0.14 in c:\users\abc\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6; extra == "socks" in c:\users\abc\anaconda3\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\abc\anaconda3\lib\site-packages (from cffi>=1.14; os_name == "nt" and implementation_name != "pypy"->trio~=0.17->selenium) (2.19)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\abc\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)
Requirement already satisfied: typing-extensions; python_version < "3.8" in c:\users\abc\anaconda3\lib\site-packages (from h11<1,>=0.9.0->wsproto>=0.14->trio-websocket~=0.9->selenium) (4.3.0)

In [2]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.common.exceptions import StaleElementReferenceException, NoSuchElementException
from selenium.webdriver.common.by import By
import time

In [3]:
#connecting to the driver
driver=webdriver.Chrome(r"C:\python\chromedriver.exe")

# Q.1)

In [4]:
#opening the naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [5]:
#Entering designation and location as required in question

designation=driver.find_element(By.CLASS_NAME,'suggestor-input')
designation.send_keys('Data Analyst')

In [6]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/input")
location.send_keys('Bangalore')

In [7]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [14]:
#creating empty list
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [15]:
#scraping job title
title_tags=driver.find_elements(By.XPATH,"//a[@class='title fw500 ellipsis']")
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
#scraping job location
location_tags=driver.find_elements(By.XPATH,"//li[@class='fleft grey-text br2 placeHolderLi location']")
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
#scraping company name
company_tags=driver.find_elements(By.XPATH,"//a[@class='subTitle ellipsis fleft']")
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

#scraping job experience
experience_tags=driver.find_elements(By.XPATH,"//li[@class='fleft grey-text br2 placeHolderLi experience']")
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [17]:
#creating dataframe
df=pd.DataFrame({'Job-title':job_title,'Location':job_location,'Company-Name':company_name,'Exp.Required':experience_required})
df

,Job-title,Location,Company-Name,Exp.Required
0,Senior Data Analyst,"Bangalore/Bengaluru, Chennai",Latentview,3-6 Yrs
1,Data Analyst - CRM Platform,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",Artech infosystem,1-6 Yrs
2,Hiring For Data Analyst (DA)/ Team Lead (TL) -...,"Bangalore/Bengaluru, Kolkata, Hyderabad/Secund...",Cognizant,3-8 Yrs
3,Payroll Transformation Data Analyst,Bangalore/Bengaluru,Arrow Electronics,5-10 Yrs
4,Master Data Management Business Analyst,Bangalore/Bengaluru,Accenture,6-8 Yrs
5,Data Analytics and Interpretation Business Ana...,Bangalore/Bengaluru,Accenture,6-8 Yrs
6,Data Analyst,Bangalore/Bengaluru,ANZ,7-12 Yrs
7,Data Analyst,Bangalore/Bengaluru,ANZ,7-12 Yrs
8,Senior Data Analyst,Bangalore/Bengaluru,Goalreify Ventures,3-6 Yrs
9,Senior Data Analyst,Bangalore/Bengaluru,Goalreify Ventures,4-6 Yrs

# Q.2)

In [19]:
#opening the naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [20]:
#Entering designation and location as required in question

designation=driver.find_element(By.CLASS_NAME,'suggestor-input')
designation.send_keys('Data Scientist')

In [21]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/input")
location.send_keys('Bangalore')

In [22]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [23]:
#creating empty list
job_title=[]
job_location=[]
company_name=[]

In [24]:
#scraping job title
title_tags=driver.find_elements(By.XPATH,"//a[@class='title fw500 ellipsis']")
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
#scraping job location
location_tags=driver.find_elements(By.XPATH,"//li[@class='fleft grey-text br2 placeHolderLi location']")
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
#scraping company name
company_tags=driver.find_elements(By.XPATH,"//a[@class='subTitle ellipsis fleft']")
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [25]:
#creating dataframe
df=pd.DataFrame({'Job-title':job_title,'Location':job_location,'Company-Name':company_name})
df

,Job-title,Location,Company-Name
0,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture
1,Data Science Manager,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture
2,"Mongodb Database Administrator, Maria DB or Ca...","Bangalore/Bengaluru, Hyderabad/Secunderabad, P...",Mphasis
3,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture
4,Assistant Manager - Data Science,"Bangalore/Bengaluru, Mumbai, Pune",CitiusTech
5,Data Scientist,"Bangalore/Bengaluru, Hyderabad/Secunderabad, P...",Tech Mahindra
6,Senior Data Scientist,"Bangalore/Bengaluru, Mumbai, New Delhi, Chennai",Boston Consulting Group
7,Module Lead - BIDW,Bangalore/Bengaluru,Mphasis
8,Data Scientist: Artificial Intelligence,Bangalore/Bengaluru,IBM
9,ACN - Applied Intelligence - C4DI - Sustainabi...,Bangalore/Bengaluru,Accenture

# Q.3)

In [26]:
#opening the naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [27]:
#Entering designation as required in question

designation=driver.find_element(By.CLASS_NAME,'suggestor-input')
designation.send_keys('Data Scientist')

In [28]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [42]:
#Applying location filter
loc=driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/section[1]/div[2]/div[5]/div[2]/div[3]")
loc.click()

In [43]:
#Applying salary filter
sal=driver.find_element(By.XPATH,"/html/body/div[1]/div[4]/div/section[1]/div[2]/div[6]/div[2]/div[2]")
sal.click()

In [45]:
#creating empty list
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [46]:
#scraping job title
title_tags=driver.find_elements(By.XPATH,"//a[@class='title fw500 ellipsis']")
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)
    
#scraping job location
location_tags=driver.find_elements(By.XPATH,"//li[@class='fleft grey-text br2 placeHolderLi location']")
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)
    
#scraping company name
company_tags=driver.find_elements(By.XPATH,"//a[@class='subTitle ellipsis fleft']")
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

#scraping job experience
experience_tags=driver.find_elements(By.XPATH,"//li[@class='fleft grey-text br2 placeHolderLi experience']")
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [47]:
#creating dataframe
df=pd.DataFrame({'Job-title':job_title,'Location':job_location,'Company-Name':company_name,'Exp.Required':experience_required})
df

,Job-title,Location,Company-Name,Exp.Required
0,Data Scientist,"Noida, Nagpur, Bangalore/Bengaluru",GlobalLogic,8-10 Yrs
1,DigitalBCG GAMMA Data Scientist,"New Delhi, Bangalore/Bengaluru",Boston Consulting Group,2-5 Yrs
2,Lead Data Scientist,Noida(Sector-59 Noida)\n(WFH during Covid),R Systems International,7-10 Yrs
3,Data Scientist,Gurgaon/Gurugram,IHS Markit,3-6 Yrs
4,Data Scientist - Engine Algorithm,"Delhi / NCR, Kolkata, Mumbai, Hyderabad/Secund...",Primo Hiring,1-3 Yrs
5,Data Scientist,Gurgaon/Gurugram,Optum,2-7 Yrs
6,Data Scientist / Chat-bot Developer,"New Delhi, Bangalore/Bengaluru, Mumbai (All Ar...",Big Seo Buzz,3-7 Yrs
7,Data Activation Specialist - Adobe Target,"Delhi / NCR, Kolkata, Mumbai, Hyderabad/Secund...",Okda Solutions,7-10 Yrs
8,Data Scientist,Noida,NGI Ventures,0-5 Yrs
9,Data Scientist,"Dehradun, Hyderabad/Secunderabad, Gurgaon/Guru...",torcai digital media,2-7 Yrs

# Q.4)

In [48]:
#opening the flipkart page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [53]:
#Entering sunglasses as required in question
sunglass=driver.find_element(By.CLASS_NAME,'_3704LK')
sunglass.send_keys('Sunglasses')

In [54]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [65]:
#scraping brand of sunglasses
brand=[]
start=0
end=3
for page in range(start,end):
    brands=driver.find_elements(By.XPATH,"//div[@class='_2WkVRV']")
    for i in brands:
        brand.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [71]:
#scraping product description of sunglasses
product_des=[]
start=0
end=3
for page in range(start,end):
    pd=driver.find_elements(By.XPATH,"//a[@class='IRpwTa']")
    for i in pd:
        product_des.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [73]:
#scraping product price of sunglasses
price=[]
start=0
end=3
for page in range(start,end):
    pp=driver.find_elements(By.XPATH,"//div[@class='_30jeq3']")
    for i in pp:
        price.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [75]:
#scraping dicount of sunglasses
discount=[]
start=0
end=3
for page in range(start,end):
    dis=driver.find_elements(By.XPATH,"//div[@class='_3Ay6Sb']")
    for i in dis:
        discount.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [81]:
#creating dataframe
df=pd.DataFrame({'Brands':brand,'Product-description':product_des,"Price":price,"Discount":discount})
df[0:100]   #to get just top 100 list of sunglasses

,Brands,Product-description,Price,Discount
0,AISLIN,Others Aviator Sunglasses (61),₹200,41% off
1,FOSSIL,Polarized Retro Square Sunglasses (53),₹79,66% off
2,Fastrack,UV Protection Wayfarer Sunglasses (Free Size),₹79,50% off
3,Fastrack,UV Protection Rectangular Sunglasses (Free Size),"₹2,899",43% off
4,Bedst,Others Round Sunglasses (59),₹200,84% off
...,...,...,...,...
95,IZAAN MART,Others Aviator Sunglasses (61),"₹2,999",50% off
96,NuVew,UV Protection Aviator Sunglasses (58),₹79,37% off
97,Fastrack,"UV Protection, Mirrored Wayfarer Sunglasses (57)",₹156,91% off
98,Mi,Polarized Aviator Sunglasses (Free Size),₹438,58% off
99,IZAAN MART,Night Vision Rectangular Sunglasses (55),₹899,75% off

# Q.5)

In [7]:
#opening the flipkart page for all the reviews of iphone11 on automated chrome browser
driver.get("https://www.flipkart.com/apple-iphone-11-black-128-gb/product-reviews/itm8244e8d955aba?pid=MOBFWQ6BKRYBP5X8&lid=LSTMOBFWQ6BKRYBP5X8IBG6BS&marketplace=FLIPKART")

In [200]:
#scraping rating
rating=[]
start=0
end=13
for page in range(start,end):
    rats=driver.find_elements(By.XPATH,"//div[@class='_3LWZlK _1BLPMq']")
    for i in rats:
        rating.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [202]:
#scraping review summary
rs=[]
start=0
end=13
for page in range(start,end):
    rsum=driver.find_elements(By.XPATH,"//p[@class='_2-N8zT']")
    for i in rsum:
        rs.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [204]:
#scraping full review
fr=[]
start=0
end=13
for page in range(start,end):
    fullr=driver.find_elements(By.XPATH,"//div[@class='t-ZTKy']")
    for i in fullr:
        fr.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [207]:
#creating dataframe
import pandas as pd
df=pd.DataFrame({'Rating':rating,'Review-Summary':rs,'Full-Review':fr})
df[0:100]

,Rating,Review-Summary,Full-Review
0,5,Perfect product!,After using 3 years mobile review. Excellent &...
1,5,Terrific,I am using the phone for last 5 years and foun...
2,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
3,5,Wonderful,Nice product..just love it
4,4,Good quality product,impressively Nice......\nOne of the greatest i...
...,...,...,...
95,5,Mind-blowing purchase,Fantastic and prompt delivery.
96,5,Perfect product!,After using 3 years mobile review. Excellent &...
97,5,Terrific,I am using the phone for last 5 years and foun...
98,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
99,5,Wonderful,Nice product..just love it

# Q.6)

In [118]:
#opening the flipkart page on automated chrome browser
driver.get("https://www.flipkart.com/")

In [138]:
#Entering sneakers as required in question
sneakers=driver.find_element(By.CLASS_NAME,'_3704LK')
sneakers.send_keys('sneakers')

In [139]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [140]:
#scraping brand of sneakers
brand=[]
start=0
end=3
for page in range(start,end):
    brands=driver.find_elements(By.XPATH,"//div[@class='_2WkVRV']")
    for i in brands:
        brand.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [141]:
#scraping product description of sneakers
product_des=[]
start=0
end=3
for page in range(start,end):
    pd=driver.find_elements(By.XPATH,"//a[@class='IRpwTa']")
    for i in pd:
        product_des.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [143]:
#scraping product price of sneakers
price=[]
start=0
end=3
for page in range(start,end):
    pp=driver.find_elements(By.XPATH,"//div[@class='_30jeq3']")
    for i in pp:
        price.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [144]:
#scraping dicount of sneakers
discount=[]
start=0
end=3
for page in range(start,end):
    dis=driver.find_elements(By.XPATH,"//div[@class='_3Ay6Sb']")
    for i in dis:
        discount.append(i.text)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [145]:
#creating dataframe
import pandas as pd
df=pd.DataFrame({'Brands':brand,'Product-description':product_des,"Price":price,"Discount":discount})
df[0:100]   #to get just top 100 list of sneakers

,Brands,Product-description,Price,Discount
0,BRUTON,2 Combo Sneaker Shoes Sneakers For Men,₹143,84% off
1,World Wear Footwear,Sneakers For Men,₹143,81% off
2,TR,Stylish & Trending Outdoor Walking Comfortable...,₹239,65% off
3,TR,Sneakers For Men,₹319,78% off
4,World Wear Footwear,Synthetic Leather Casual Sneaker shoes for Men...,₹179,58% off
...,...,...,...,...
95,Labbin,Premium Casual Shoes White Sneakers For Men,₹379,73% off
96,K' Footlance,Sneakers For Men,₹239,55% off
97,Shozie,Sneakers For Men,₹318,73% off
98,Magnolia,Sneakers For Men,₹239,53% off
99,Zixer,Sneakers For Men,"₹1,049",78% off

# Q.7)

In [146]:
#opening the myntra page on automated chrome browser
driver.get('http://www.myntra.com/shoes')

In [154]:
#Applying price filter
price=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label")
price.click()

In [153]:
#Applying color filter
color=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]")
color.click()

In [159]:
#scraping brand of shoes
brand=[]
start=0
end=2
for page in range(start,end):
    brands=driver.find_elements(By.XPATH,"//h3[@class='product-brand']")
    for i in brands:
        brand.append(i.text)
    next_button=driver.find_element(By.XPATH,'//li[@class="pagination-next"]')
    next_button.click()
    time.sleep(3)

In [161]:
#scraping description of shoes
des=[]
start=0
end=2
for page in range(start,end):
    de=driver.find_elements(By.XPATH,"//h4[@class='product-product']")
    for i in de:
        des.append(i.text)
    next_button=driver.find_element(By.XPATH,'//li[@class="pagination-next"]')
    next_button.click()
    time.sleep(3)

In [173]:
#scraping prices of shoes
price=[]
start=0
end=2
for page in range(start,end):
    prices=driver.find_elements(By.XPATH,"//div[@class='product-price']")
    for i in prices:
        price.append(i.text)
    next_button=driver.find_element(By.XPATH,'//li[@class="pagination-next"]')
    next_button.click()
    time.sleep(3)

In [175]:
#creating dataframe
import pandas as pd
df=pd.DataFrame({'Brands':brand,'Product-description':des,"Price":price})
df

,Brands,Product-description,Price
0,fitflop,Men Solid Formal Loafers,Rs. 8999
1,ALDO,Women Woven Design PU Sneakers,Rs. 5999
2,fitflop,Virat Kohli Fuse 2.0 Camo,Rs. 8449Rs. 12999(35% OFF)
3,ALDO,Men Solid Leather Formal Derbys,Rs. 5999
4,DAVINCHI,Men Leather Tasselled Slip-Ons,Rs. 5999
...,...,...,...
95,ASICS,Men Textured Driving Shoes,Rs. 6079Rs. 7599(20% OFF)
96,Puma,Women Lace Espadrilles,Rs. 9999
97,ROSSO BRUNELLO,Men Formal Loafer Shoes,Rs. 5990
98,Clarks,Men Solid Formal Leather Boots,Rs. 8399Rs. 11999(30% OFF)
99,ROSSO BRUNELLO,Leather Wedge Sandals,Rs. 6399Rs. 7999(20% OFF)

# Q.8)

In [35]:
#opening the amazon page on automated chrome browser
driver.get("https://www.amazon.in/")

In [36]:
#Entering laptop as required in question
laptop=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
laptop.send_keys('laptop')

In [40]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
search.click()

In [45]:
#Applying CPU filter
cpu=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[5]/li[11]/span/a/div/label/i")
cpu.click()

In [151]:
#creating empty list
title=[]
ra1=[]
price1=[]

In [161]:
#scraping laptop title
title_tags=driver.find_elements(By.XPATH,"//h2[@class='a-size-mini a-spacing-none a-color-base s-line-clamp-2']")
for i in title_tags[0:10]:
    titles=i.text
    title.append(titles)

In [152]:
#scraping laptop ratings
rating_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-base s-underline-text"]')
for i in rating_tags[0:10]:
    r=i.text
    ra1.append(r)

In [156]:
#scraping laptop price
price_tags=driver.find_elements(By.XPATH,"//span[@class='a-price-whole']")
for i in price_tags[0:10]:
    p=i.text
    price1.append(p)

In [162]:
#creating dataframe
import pandas as pd
df=pd.DataFrame({'Title':title,'Price':price1,'Ratings':ra1})
df

                                               Title     Price Ratings
0  Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...    80,000      12
1  LG Gram Intel Evo 11th Gen Core i7 17"(43cm)Ul...    91,990      62
2  ASUS Zenbook 13 OLED, 13.3-inch (33.78 cms) FH...    74,990       6
3  ASUS Vivobook 15, 15.6-inch (39.62 cms) FHD, I...    64,990      57
4  Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...    80,000      12
5  HP Pavilion x360 11th Gen Intel Core i7 14 inc...    80,990       4
6  Lenovo ThinkBook 15 Intel 11th Gen Core i7 15....    77,990      62
7  Hp Pavilion 15 12Th Gen Intel Core I7 16Gb Sdr...    91,090      33
8  Lenovo Yoga 7i 11th Gen Intel Core i7-1165G7 1...  1,12,999      89
9  Acer Nitro 5 Core i7 11th Gen 15.6" (39.62cms)...    89,990      84

# Q.10)

In [318]:
#opening the ambitionbox page on automated chrome browser
driver.get("https://www.ambitionbox.com/")

In [327]:
sal=driver.find_element(By.XPATH,'//a[@class="subNavListItem router-link-exact-active router-link-active"]')
print(sal.get_attribute('href'))

https://www.ambitionbox.com/salaries?campaign=desktop_nav

In [335]:
#Entering designation as required in question
designation=driver.find_element(By.XPATH,'//input[@class="tt-input"]')
designation.send_keys('Data Scientist')

In [338]:
#scraping company name
name=[]
name_tags=driver.find_elements(By.XPATH,"//div[@class='company-info']")
for i in name_tags[0:10]:
    n=i.text.split('\n')[0]
    name.append(n)

In [339]:
name

['Walmart',
 'Ab Inbev',
 'Optum',
 'ZS',
 'Fractal Analytics',
 'Sigmoid Analytics',
 'Tiger Analytics',
 'Legato Health Technologies',
 'HSBC',
 'Tredence']

In [346]:
#scraping experienced required
exp=[]
exp_tags=driver.find_elements(By.XPATH,"//div[@class='company-info']")
for i in exp_tags[0:10]:
    e=i.text.split('\n')[2]
    exp.append(e)

In [347]:
exp

['3-4 yrs experience (based on 24 salaries)',
 '2-4 yrs experience (based on 59 salaries)',
 '2-4 yrs experience (based on 49 salaries)',
 '1-2 yrs experience (based on 35 salaries)',
 '2-4 yrs experience (based on 118 salaries)',
 '1 yr experience (based on 10 salaries)',
 '2-4 yrs experience (based on 70 salaries)',
 '4 yrs experience (based on 11 salaries)',
 '4 yrs experience (based on 10 salaries)',
 '3 yrs experience (based on 14 salaries)']

In [360]:
#scraping minimum salary
mi=[]
min_tags=driver.find_elements(By.XPATH,'//div[@class="value body-medium"]')
for i in min_tags:
    m=i.text
    mi.append(m)

In [364]:
min=mi[0:20:2]
min

['₹ 25.0L',
 '₹ 15.0L',
 '₹ 11.0L',
 '₹ 11.0L',
 '₹ 9.0L',
 '₹ 12.7L',
 '₹ 9.0L',
 '₹ 11.0L',
 '₹ 12.0L',
 '₹ 8.8L']

In [365]:
#scraping maximum salary
ma=[]
max_tags=driver.find_elements(By.XPATH,"//div[@class='value body-medium']")
for i in max_tags:
    mn=i.text
    ma.append(mn)

In [369]:
max=ma[1:20:2]
max

['₹ 45.0L',
 '₹ 26.0L',
 '₹ 22.6L',
 '₹ 22.0L',
 '₹ 23.0L',
 '₹ 19.7L',
 '₹ 20.0L',
 '₹ 20.0L',
 '₹ 18.0L',
 '₹ 17.5L']

In [370]:
#scraping average salary
avg=[]
a_tags=driver.find_elements(By.XPATH,"//p[@class='averageCtc']")
for i in a_tags:
    a=i.text
    avg.append(a)

In [371]:
avg

['₹ 32.2L',
 '₹ 19.8L',
 '₹ 16.4L',
 '₹ 15.9L',
 '₹ 15.5L',
 '₹ 14.7L',
 '₹ 14.6L',
 '₹ 14.5L',
 '₹ 14.0L',
 '₹ 13.9L']

In [372]:
#creating database
import pandas as pd
df=pd.DataFrame({'company-name':name,'experienced-required(total salary record)':exp,'minimum-salary':min,'average-salary':avg,'maximum-salary':max})
df

,company-name,experienced-required(total salary record),minimum-salary,average-salary,maximum-salary
0,Walmart,3-4 yrs experience (based on 24 salaries),₹ 25.0L,₹ 32.2L,₹ 45.0L
1,Ab Inbev,2-4 yrs experience (based on 59 salaries),₹ 15.0L,₹ 19.8L,₹ 26.0L
2,Optum,2-4 yrs experience (based on 49 salaries),₹ 11.0L,₹ 16.4L,₹ 22.6L
3,ZS,1-2 yrs experience (based on 35 salaries),₹ 11.0L,₹ 15.9L,₹ 22.0L
4,Fractal Analytics,2-4 yrs experience (based on 118 salaries),₹ 9.0L,₹ 15.5L,₹ 23.0L
5,Sigmoid Analytics,1 yr experience (based on 10 salaries),₹ 12.7L,₹ 14.7L,₹ 19.7L
6,Tiger Analytics,2-4 yrs experience (based on 70 salaries),₹ 9.0L,₹ 14.6L,₹ 20.0L
7,Legato Health Technologies,4 yrs experience (based on 11 salaries),₹ 11.0L,₹ 14.5L,₹ 20.0L
8,HSBC,4 yrs experience (based on 10 salaries),₹ 12.0L,₹ 14.0L,₹ 18.0L
9,Tredence,3 yrs experience (based on 14 salaries),₹ 8.8L,₹ 13.9L,₹ 17.5L